Task/src/Documents/ПриходныйКассовыйОрдер/ПриходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходныйКассовыйОрдер</name>
  <basedOn>Document.Задача</basedOn>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Касса</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыРассчетов</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.Задача</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Task/src/Documents/ПриходныйКассовыйОрдер/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПодборЗадач(Команда)
	Парм = Новый Структура;
	Парм.Вставить("Партнер",Объект.Партнер);
	Парм.Вставить("Сумма",Объект.Сумма);
	ОткрытьФорму("Обработка.ПодборЗадач.Форма.Форма",Парм,,,,,Новый ОписаниеОповещения("ЗаполнитьДокументЗадачами",ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументЗадачами(Результат,хзчтозапар) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		Для Каждого Стр Из Результат Цикл
			нСтр = Объект.ОбъектыРассчетов.Добавить();
			ЗаполнитьЗначенияСвойств(нСтр,Стр);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
